# Panda
#### Panda is an extremely powerfull version of exel. this library allows us to do lot of thing with data.
* always run all import cell

In [1]:
import pandas as pd

#### series
* A series is similar to a numpy array but its have axis labels instead of  location and its also hold any arbitary python object.

## creating a series with list

In [2]:
import numpy as np

In [3]:
my_list = [1, 2, 3, 4, 5]
# create a label
labels = ['a','b','c','d','e']

In [4]:
# default:
pd.Series(data=my_list) # by default index position have numeric value.

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
# using labels
pd.Series(data=my_list,index=labels) # also write: pd.Series(my_list,labels)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
list1 = ['A','B','C','D','E']

In [7]:
pd.Series(list1) # its the example of panda's object holding power

0    A
1    B
2    C
3    D
4    E
dtype: object

## using arrays

In [8]:
arr = np.arange(1,4)

In [9]:
pd.Series(arr)

0    1
1    2
2    3
dtype: int32

In [10]:
labels = ['x','y','z']

In [11]:
pd.Series(arr,labels)

x    1
y    2
z    3
dtype: int32

## using dictionary

In [12]:
my_dict = {'k1': 1, "k2": 3, 'k3': 6}

In [13]:
pd.Series(my_dict)

k1    1
k2    3
k3    6
dtype: int64

In [14]:
dict1 = {'name1':'hello', 'name2': 'hi'}

In [15]:
pd.Series(dict1)

name1    hello
name2       hi
dtype: object

## series operation
* operation based off of index

In [16]:
series1 = pd.Series(data = [1,2,3,4], index = ['ami','tumi','se','tini'])

In [17]:
series2 = pd.Series(data= [4,3,2,1], index = ['ami','tumi','uni','tini'])

In [18]:
series1 + series2

ami     5.0
se      NaN
tini    5.0
tumi    5.0
uni     NaN
dtype: float64

In [19]:
series1 * series2

ami     4.0
se      NaN
tini    4.0
tumi    6.0
uni     NaN
dtype: float64

In [20]:
# we can also do other operation. but note that if index position not match up then the output give none value of those not match index

## Panda DataFrame:
* dataframe is the main workhorse of pandas. a dataframe have bunch of series objects, all the series share the same index.

In [21]:
from numpy.random import randn

In [22]:
# creating a dataframe
df = pd.DataFrame(data = randn(5,5), index = 'A B C D E'.split(), columns = 'w x y z m'.split())

In [23]:
df

          w         x         y         z         m
A -0.885079  0.663484  0.908516 -0.445684 -0.934784
B  1.301465  1.178786 -0.504680 -0.290679 -0.817264
C  0.407582  0.157708  0.693082  1.084711  1.113279
D  1.224431 -0.170501  0.557802  1.256453 -0.128833
E -0.161968  0.064601  0.708936  1.408893 -1.575258

#### selection and indexing of DataFrame

#### with respect of column

In [24]:
df['w']

A   -0.885079
B    1.301465
C    0.407582
D    1.224431
E   -0.161968
Name: w, dtype: float64

In [25]:
type(df['w']) # we can see that this return a series

pandas.core.series.Series

In [26]:
df['m']

A   -0.934784
B   -0.817264
C    1.113279
D   -0.128833
E   -1.575258
Name: m, dtype: float64

In [27]:
# we can also indexing a list of columns
df[['x','y','z']]

          x         y         z
A  0.663484  0.908516 -0.445684
B  1.178786 -0.504680 -0.290679
C  0.157708  0.693082  1.084711
D -0.170501  0.557802  1.256453
E  0.064601  0.708936  1.408893

#### with respect of row

In [28]:
df.loc['B']

w    1.301465
x    1.178786
y   -0.504680
z   -0.290679
m   -0.817264
Name: B, dtype: float64

In [29]:
type(df.loc['B']) # its also return a series

pandas.core.series.Series

#### selecting subset of rows and columns

In [30]:
df.loc['A','m']

-0.9347840185898764

In [31]:
df.loc[["A",'B'],['w','m']]

          w         m
A -0.885079 -0.934784
B  1.301465 -0.817264

#### creating new columns using series operation

In [32]:
df['n'] = df['x'] * df['y']

In [33]:
df

          w         x         y         z         m         n
A -0.885079  0.663484  0.908516 -0.445684 -0.934784  0.602786
B  1.301465  1.178786 -0.504680 -0.290679 -0.817264 -0.594910
C  0.407582  0.157708  0.693082  1.084711  1.113279  0.109304
D  1.224431 -0.170501  0.557802  1.256453 -0.128833 -0.095106
E -0.161968  0.064601  0.708936  1.408893 -1.575258  0.045798

#### creating new row using series operetion

In [34]:
df.loc['F'] = df.loc['B'] +  df.loc['C']

In [35]:
df

          w         x         y         z         m         n
A -0.885079  0.663484  0.908516 -0.445684 -0.934784  0.602786
B  1.301465  1.178786 -0.504680 -0.290679 -0.817264 -0.594910
C  0.407582  0.157708  0.693082  1.084711  1.113279  0.109304
D  1.224431 -0.170501  0.557802  1.256453 -0.128833 -0.095106
E -0.161968  0.064601  0.708936  1.408893 -1.575258  0.045798
F  1.709047  1.336494  0.188402  0.794032  0.296015 -0.485605

#### removing column from dataframe

In [36]:
df.drop('n',axis=1)

          w         x         y         z         m
A -0.885079  0.663484  0.908516 -0.445684 -0.934784
B  1.301465  1.178786 -0.504680 -0.290679 -0.817264
C  0.407582  0.157708  0.693082  1.084711  1.113279
D  1.224431 -0.170501  0.557802  1.256453 -0.128833
E -0.161968  0.064601  0.708936  1.408893 -1.575258
F  1.709047  1.336494  0.188402  0.794032  0.296015

In [37]:
# now if we check the original dataframe we can see 'n' column not remove from dataframe
print(df)

          w         x         y         z         m         n
A -0.885079  0.663484  0.908516 -0.445684 -0.934784  0.602786
B  1.301465  1.178786 -0.504680 -0.290679 -0.817264 -0.594910
C  0.407582  0.157708  0.693082  1.084711  1.113279  0.109304
D  1.224431 -0.170501  0.557802  1.256453 -0.128833 -0.095106
E -0.161968  0.064601  0.708936  1.408893 -1.575258  0.045798
F  1.709047  1.336494  0.188402  0.794032  0.296015 -0.485605

In [38]:
# if we want permanently remove any column
df.drop('n', axis = 1, inplace = True) # or use del df['n']

In [39]:
print(df)

          w         x         y         z         m
A -0.885079  0.663484  0.908516 -0.445684 -0.934784
B  1.301465  1.178786 -0.504680 -0.290679 -0.817264
C  0.407582  0.157708  0.693082  1.084711  1.113279
D  1.224431 -0.170501  0.557802  1.256453 -0.128833
E -0.161968  0.064601  0.708936  1.408893 -1.575258
F  1.709047  1.336494  0.188402  0.794032  0.296015

#### removing row from dataframe

In [40]:
df.drop('F', axis = 0)

          w         x         y         z         m
A -0.885079  0.663484  0.908516 -0.445684 -0.934784
B  1.301465  1.178786 -0.504680 -0.290679 -0.817264
C  0.407582  0.157708  0.693082  1.084711  1.113279
D  1.224431 -0.170501  0.557802  1.256453 -0.128833
E -0.161968  0.064601  0.708936  1.408893 -1.575258

In [41]:
# here also we can see row does't remove from original dataframe
df

          w         x         y         z         m
A -0.885079  0.663484  0.908516 -0.445684 -0.934784
B  1.301465  1.178786 -0.504680 -0.290679 -0.817264
C  0.407582  0.157708  0.693082  1.084711  1.113279
D  1.224431 -0.170501  0.557802  1.256453 -0.128833
E -0.161968  0.064601  0.708936  1.408893 -1.575258
F  1.709047  1.336494  0.188402  0.794032  0.296015

In [42]:
# for permanent remove of any row
df.drop('F', axis = 0, inplace = True)

In [43]:
df

          w         x         y         z         m
A -0.885079  0.663484  0.908516 -0.445684 -0.934784
B  1.301465  1.178786 -0.504680 -0.290679 -0.817264
C  0.407582  0.157708  0.693082  1.084711  1.113279
D  1.224431 -0.170501  0.557802  1.256453 -0.128833
E -0.161968  0.064601  0.708936  1.408893 -1.575258

#### conditional selection

In [44]:
# its same as the numpy selection. return the boolean value
df>0

       w      x      y      z      m
A  False   True   True  False  False
B   True   True  False  False  False
C   True   True   True   True   True
D   True  False   True   True  False
E  False   True   True   True  False

In [45]:
# for getting the true value of the dataframe we can pass the dataframe with the original one
df[df>0] # note that here the false values shown as NaN values

          w         x         y         z         m
A       NaN  0.663484  0.908516       NaN       NaN
B  1.301465  1.178786       NaN       NaN       NaN
C  0.407582  0.157708  0.693082  1.084711  1.113279
D  1.224431       NaN  0.557802  1.256453       NaN
E       NaN  0.064601  0.708936  1.408893       NaN

In [46]:
# we can also seletion over a specified colums
df[df['w']<0]

          w         x         y         z         m
A -0.885079  0.663484  0.908516 -0.445684 -0.934784
E -0.161968  0.064601  0.708936  1.408893 -1.575258

In [47]:
# we get another column or columns with the basis of a column conditional selection
df[df['w']>0]['m']

B   -0.817264
C    1.113279
D   -0.128833
Name: m, dtype: float64

In [48]:
df[df['w']>0][['z','m']]

          z         m
B -0.290679 -0.817264
C  1.084711  1.113279
D  1.256453 -0.128833

#### using logical operator(&,|)

In [49]:
df[(df['w']>0) & (df['m']<1)]

          w         x         y         z         m
B  1.301465  1.178786 -0.504680 -0.290679 -0.817264
D  1.224431 -0.170501  0.557802  1.256453 -0.128833

In [50]:
df[(df['w']>0) | (df['m']<1)]

          w         x         y         z         m
A -0.885079  0.663484  0.908516 -0.445684 -0.934784
B  1.301465  1.178786 -0.504680 -0.290679 -0.817264
C  0.407582  0.157708  0.693082  1.084711  1.113279
D  1.224431 -0.170501  0.557802  1.256453 -0.128833
E -0.161968  0.064601  0.708936  1.408893 -1.575258

#### creating columns using list

In [51]:
df['new'] = 'a b c d e'.split()

In [52]:
df

          w         x         y         z         m new
A -0.885079  0.663484  0.908516 -0.445684 -0.934784   a
B  1.301465  1.178786 -0.504680 -0.290679 -0.817264   b
C  0.407582  0.157708  0.693082  1.084711  1.113279   c
D  1.224431 -0.170501  0.557802  1.256453 -0.128833   d
E -0.161968  0.064601  0.708936  1.408893 -1.575258   e

#### some index function

In [53]:
df.reset_index() # default index

  index         w         x         y         z         m new
0     A -0.885079  0.663484  0.908516 -0.445684 -0.934784   a
1     B  1.301465  1.178786 -0.504680 -0.290679 -0.817264   b
2     C  0.407582  0.157708  0.693082  1.084711  1.113279   c
3     D  1.224431 -0.170501  0.557802  1.256453 -0.128833   d
4     E -0.161968  0.064601  0.708936  1.408893 -1.575258   e

In [54]:
df.set_index('new')

            w         x         y         z         m
new
a   -0.885079  0.663484  0.908516 -0.445684 -0.934784
b    1.301465  1.178786 -0.504680 -0.290679 -0.817264
c    0.407582  0.157708  0.693082  1.084711  1.113279
d    1.224431 -0.170501  0.557802  1.256453 -0.128833
e   -0.161968  0.064601  0.708936  1.408893 -1.575258

In [55]:
# this change is not permanent
df

          w         x         y         z         m new
A -0.885079  0.663484  0.908516 -0.445684 -0.934784   a
B  1.301465  1.178786 -0.504680 -0.290679 -0.817264   b
C  0.407582  0.157708  0.693082  1.084711  1.113279   c
D  1.224431 -0.170501  0.557802  1.256453 -0.128833   d
E -0.161968  0.064601  0.708936  1.408893 -1.575258   e

In [56]:
# for permanent change
# run: df.set_index('new',inplace = True)

#### multi index and index hierarcht

In [57]:
outside_index = ['A','A','B','B']
inside_index = [1,2,1,2]
new_index = list(zip(outside_index,inside_index))
main_index = pd.MultiIndex.from_tuples(new_index)

In [58]:
new_index

[('A', 1), ('A', 2), ('B', 1), ('B', 2)]

In [59]:
main_index

MultiIndex([('A', 1),
            ('A', 2),
            ('B', 1),
            ('B', 2)],
           )

In [60]:
df = pd.DataFrame(randn(4,2), index = main_index, columns = ['x','y'])

In [61]:
df

            x         y
A 1  0.492266 -0.143281
  2 -0.634169 -1.113664
B 1  1.219152  2.414341
  2  3.494110  0.462042

In [62]:
df.loc['A']

          x         y
1  0.492266 -0.143281
2 -0.634169 -1.113664

In [63]:
df.loc['B']

          x         y
1  1.219152  2.414341
2  3.494110  0.462042

In [64]:
# we can all the operation using this dataframe

## missing data in dataframe
* here we can customize our data frame

In [65]:
# create a dataframe of nan values
data = {'A':[np.nan,4,np.nan],'B':[3,6,3],'C':[np.nan,4,9]}
df = pd.DataFrame(data)

In [66]:
df

     A  B    C
0  NaN  3  NaN
1  4.0  6  4.0
2  NaN  3  9.0

In [67]:
# removing NaN values from dataframe
df.dropna() # its remove all the row which have NaN values

     A  B    C
1  4.0  6  4.0

In [68]:
df.dropna(axis=1) # its remove all the column which have NaN value

   B
0  3
1  6
2  3

In [69]:
df.dropna(thresh = 2) # its remove the row which have two NaN value

     A  B    C
1  4.0  6  4.0
2  NaN  3  9.0

In [70]:
# we fill the NaN values using
df.fillna('hello') # by passing the argument we want. note this change is not permanent.

       A  B      C
0  hello  3  hello
1      4  6      4
2  hello  3      9

In [71]:
df

     A  B    C
0  NaN  3  NaN
1  4.0  6  4.0
2  NaN  3  9.0

In [72]:
df.fillna(100)

       A  B      C
0  100.0  3  100.0
1    4.0  6    4.0
2  100.0  3    9.0

In [73]:
# try
df['C'].fillna(df['C'].mean())

0    6.5
1    4.0
2    9.0
Name: C, dtype: float64

## Groupby of data frame
* its allows us to group different rows with respect of a column

In [74]:
data = {'company':['amazon','amazon','amazon','flipkert','flipkert','flipkert']
       , 'product':['mobile','laptop','mixer','earphone','tv','tshirt']
       , 'sales':[4000,5000,3000,2000,1000,80000]}

In [75]:
df = pd.DataFrame(data)

In [76]:
df

    company   product  sales
0    amazon    mobile   4000
1    amazon    laptop   5000
2    amazon     mixer   3000
3  flipkert  earphone   2000
4  flipkert        tv   1000
5  flipkert    tshirt  80000

#### using the groupby() method:
* its help to group rows based off of a column name.

In [77]:
g_comp = df.groupby('company')
g_comp # its shows the memory location.

In [78]:
# using the data we can do some operation like:
g_comp.mean()

                 sales
company
amazon     4000.000000
flipkert  27666.666667

In [79]:
g_comp.min()

           product  sales
company
amazon      laptop   3000
flipkert  earphone   1000

In [80]:
g_comp.max()

         product  sales
company
amazon    mobile   5000
flipkert      tv  80000

In [81]:
g_comp.count()

          product  sales
company
amazon          3      3
flipkert        3      3

In [82]:
# we can see all of this using
print(g_comp.describe())
print(g_comp.describe().transpose())

         sales                                                              \
         count          mean          std     min     25%     50%      75%
company
amazon     3.0   4000.000000   1000.00000  3000.0  3500.0  4000.0   4500.0
flipkert   3.0  27666.666667  45324.75409  1000.0  1500.0  2000.0  41000.0


              max
company
amazon     5000.0
flipkert  80000.0
company      amazon      flipkert
sales count     3.0      3.000000
      mean   4000.0  27666.666667
      std    1000.0  45324.754090
      min    3000.0   1000.000000
      25%    3500.0   1500.000000
      50%    4000.0   2000.000000
      75%    4500.0  41000.000000
      max    5000.0  80000.000000

## Merging, Joining, Conctenating DataFrame
* its allows us to combine dataframe together

In [83]:
data1 = {'A':['a0','a1','a2'], 'B':['b0','b1','b2']}
data2 = {'A':['a1','a2','a3'], 'B':['b1','b2','b3']}
data3 = {'A':['a2','a3','a4'], 'B':['b2','b3','b4']}

In [84]:
df1 = pd.DataFrame(data1,index = [0,1,2])
df1

    A   B
0  a0  b0
1  a1  b1
2  a2  b2

In [85]:
df2 = pd.DataFrame(data2, index = [3,4,5])
df2

    A   B
3  a1  b1
4  a2  b2
5  a3  b3

In [86]:
df3 = pd.DataFrame(data3, index = [6,7,8])
df3

    A   B
6  a2  b2
7  a3  b3
8  a4  b4

#### concatinating dataframe: its add data frame with the basis of index position

In [87]:
pd.concat([df1,df2,df3])

    A   B
0  a0  b0
1  a1  b1
2  a2  b2
3  a1  b1
4  a2  b2
5  a3  b3
6  a2  b2
7  a3  b3
8  a4  b4

In [88]:
pd.concat([df1,df2,df3], axis = 1)

     A    B    A    B    A    B
0   a0   b0  NaN  NaN  NaN  NaN
1   a1   b1  NaN  NaN  NaN  NaN
2   a2   b2  NaN  NaN  NaN  NaN
3  NaN  NaN   a1   b1  NaN  NaN
4  NaN  NaN   a2   b2  NaN  NaN
5  NaN  NaN   a3   b3  NaN  NaN
6  NaN  NaN  NaN  NaN   a2   b2
7  NaN  NaN  NaN  NaN   a3   b3
8  NaN  NaN  NaN  NaN   a4   b4

#### merging dataframe: its merge dataframe with basis of column name

In [89]:
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
        'A': ['A0', 'A1', 'A2', 'A3'],
        'B': ['B0', 'B1', 'B2', 'B3']}

In [90]:
df1 = pd.DataFrame(data1)
df1

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [91]:
data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'C': ['C0', 'C1', 'C2', 'C3'],
         'D': ['D0', 'D1', 'D2', 'D3']}

In [92]:
df2 = pd.DataFrame(data2)
df2

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [93]:
pd.merge(df1,df2, on ="key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [94]:
pd.merge(df1,df2, how='inner', on ="key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

#### Joining datafrme: its allows us to combine the columns of diffrently_indexed dataframe

In [95]:
data1 ={'A': ['A0', 'A1', 'A2'],'B': ['B0', 'B1', 'B2']}

In [96]:
df1 = pd.DataFrame(data1, index = ['k0','k1','k2'])
df1

     A   B
k0  A0  B0
k1  A1  B1
k2  A2  B2

In [97]:
data2 = {'C': ['C0', 'C2', 'C3'],'D': ['D0', 'D2', 'D3']}

In [98]:
df2 = pd.DataFrame(data2, index = ['k0','k2','k3'])
df2

     C   D
k0  C0  D0
k2  C2  D2
k3  C3  D3

In [99]:
df1.join(df2)

     A   B    C    D
k0  A0  B0   C0   D0
k1  A1  B1  NaN  NaN
k2  A2  B2   C2   D2

In [100]:
df1.join(df2,how = 'outer')

      A    B    C    D
k0   A0   B0   C0   D0
k1   A1   B1  NaN  NaN
k2   A2   B2   C2   D2
k3  NaN  NaN   C3   D3

## DataFrame Operation

In [101]:
df = pd.DataFrame({"col1":[1,1,2,2,3,3,4,5],'col2':'abc bcd cab abc cab bcd dbe lks'.split(),'col3':[100,200,300,200,200,100,400,300]})

In [102]:
df

   col1 col2  col3
0     1  abc   100
1     1  bcd   200
2     2  cab   300
3     2  abc   200
4     3  cab   200
5     3  bcd   100
6     4  dbe   400
7     5  lks   300

In [103]:
# find the unique value: use unique() method
print(df['col1'].unique())
print(df['col2'].unique())
print(df['col3'].unique())

[1 2 3 4 5]
['abc' 'bcd' 'cab' 'dbe' 'lks']
[100 200 300 400]

In [104]:
# if we want to find the count of unique value: use nunique() method
print(df['col1'].nunique())
print(df['col2'].nunique())
print(df['col3'].nunique())

5
5
4

In [105]:
# if we want to show unique number with count: use value_counts()
df['col2'].value_counts()

cab    2
bcd    2
abc    2
dbe    1
lks    1
Name: col2, dtype: int64

#### applying Function:

In [106]:
def hello(x):
    return x**3

In [107]:
df['col1'].apply(hello)

0      1
1      1
2      8
3      8
4     27
5     27
6     64
7    125
Name: col1, dtype: int64

In [108]:
df['col1'].sum()

21

In [109]:
df['col2'].apply(len)

0    3
1    3
2    3
3    3
4    3
5    3
6    3
7    3
Name: col2, dtype: int64

In [110]:
# want to find column name:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [112]:
# if we sort the value of any column:
df.sort_values('col3')

   col1 col2  col3
0     1  abc   100
5     3  bcd   100
1     1  bcd   200
3     2  abc   200
4     3  cab   200
2     2  cab   300
7     5  lks   300
6     4  dbe   400

In [113]:
# find Null values:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False  False
7  False  False  False